#+TITLE: vdem-codes
#+STARTUP: content

We are often faced with the problem of merging data from sources that use different naming conventions for countries and do not have any other underlying identifier that would facilitate the merge. We have developed a rudimentary tool to deal with this problem that relies on a central master CSV file containing pairs of V-Dem codes and country names. The tool contains code for both R and Stata to take an arbitrary input list of country names and return the corresponding codes.

* Differences Between R and Stata Functions
The R function is more robust, more flexible, and marginally faster than its Stata counterpart. First, the user can specify a different input CSV file if a particular project needs one that differs from the master in any way. Second, the function allows the user to specify the name of the country variable in the data (e.g. "Country" vs. "country" vs. "Country Name" etc.). Third, the function will not complete if any country names in the input are not found in the CSV file. It will instead return those names so that they can be added to the master file. Fourth, any changes saved to the master CSV file are immediately available for use by the function without any additional actions. Finally, the R function allows the user to specify a custom set of matches if desired. This can be supplied either as a =data.frame= with columns =source= and =destination= or as a named vector in the for ~c("origin" = "destination")~.

The Stata .do file is more rudimentary. First, the variable containing country names in the data must be "country". Second, country names that do not appear in the CSV will appear as missing in Stata. Third, and most importantly, changes made to the CSV are not immediately available in the .do file. The tool contains additional code to update the .do file if the master CSV changes, but it requires the user to take additional action (and the user must have both R and GNU Make installed on their machine).

The python function mimics the R function in that it allows the user to specify a country name column, a path to the country-code csv file and issues a warning on missing country names. It has been written to work on a pandas dataframe, but it has not been tested extensively.

* Additional Included Tools
** Makefile
The project makefile is intended to be run whenever the CSV file is updated. Doing so will update the stata function to match the changes. It also re-sorts the CSV to avoid any duplication. Any entirely new codes are detected and added to a separate file that attaches a single name to each code. The hope is the makefile facilitates keeping everything up to date while avoiding any duplication. However, its conclusion may limit users to those who have GNU make installed on their system.

** Reverse Coding
For times when country names are preferred over codes (e.g. for visual inspection of data or graphics creation), the R function country_from_vcode() will convert V-Dem codes to a single country name. Like the primary function, it will return an error if an unknown code is passed to it. Similarly, the user can specify a path to a custom list of code-name pairs. The list included in the package is constructed by default of the alphabetically first name for each code. While this is often sufficient for preliminary work, this default may not be appropriate for publication settings. This function has not yet been translated to Stata or Python.

* Future Extensions/Improvements
The master CSV file needs to live in a shared place where any changes or additions are available to all users. This will avoid conflicts when new codes are added and prevent duplication of efforts when new country spellings are encountered.

One potential improvement would be to automate updates to the .do file when the CSV file is updated (or at least make it easier for users to do so without too many dependencies or technical knowledge). One suggestion that's been floated here is to host the repo on a different git service that allows the use of hooks to automatically trigger the makefile whenever a new commit is pushed.

A second potential improvement is to expand the tool dramatically to deal with problems related to country changes over time. The complexities introduced by this change would not be trivial and much more discussion is necessary.

Moving forward, this project is going to focus on R code development. This will have the advantage of both simplifying a lot of the process (e.g. we can deal with case etc pragmatically) and increasing opportunities for error handling.

An eye toward the future is important to create a flexible system that might grow to include sub-national units and additional information (e.g. continent, date-related information). 


* Project  To Do List
** DONE Organize CSV by code
CLOSED: [2018-02-05 Mon 14:21]
** DONE Check for duplicates
CLOSED: [2018-02-05 Mon 14:21]
** DONE Create a corresponding Stata .do file
CLOSED: [2018-02-05 Mon 14:21]
** Create a script that can be run by (essentially) anybody to update the Stata file on demand whenever the CSV file is updated
Currently this is a makefile that relies on R; not sure if there is a more universal solution; maybe? but if this stays on git, then we can probably assume sufficient knowledge to use
** DONE Fix the way that R shows country names not found in the file
CLOSED: [2018-02-05 Mon 14:22]
** DONE Add script to always keep CSV organized by code (and then by alpha)
CLOSED: [2018-02-05 Mon 14:22]
** DONE Reverse function to assign names based on codes
CLOSED: [2018-02-05 Mon 14:22]
** DONE Create a python version of the function
CLOSED: [2018-02-05 Mon 14:22]
** DONE Fix how R handles NA or "" country names
CLOSED: [2018-02-05 Mon 14:23]
** DONE Make the path to the vcodes file more generalizable
CLOSED: [2018-07-05 Thu 13:49]
:LOGBOOK:
CLOCK: [2018-07-05 Thu 13:47]--[2018-07-05 Thu 13:49] =>  0:02
:END:
** TODO Add a function to take a list of country names and return a list of country codes
:LOGBOOK:
CLOCK: [2018-03-12 Mon 09:33]--[2018-03-12 Mon 09:34] =>  0:01
:END:
[2018-03-12 Mon 09:33]
** TODO Translate country_from_vcode to python
** TODO automate the updating process
** NEXT Allow user-specified country-code pairs
:LOGBOOK:
CLOCK: [2018-07-05 Thu 13:50]--[2018-07-05 Thu 14:10] =>  0:20
:END:
** TODO Test length of country not found warning and add "and more" or similar if it exceeds print output limits
* Potential Future Problems
** Island nations
There are a lot of island nations that have plural names (e.g. St. Vincent and the Grenadines). We will need to think about ways to deal with data that might be labeled just as St. Vincent but may refer to all of the islands.
